Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Pickethall.tmx
Source language: ar
Languages: en

source: ومن يعمل من الصالحات وهو مؤمن فلا يخاف ظلما ولا هضما
en: And he who hath done some good works, being a believer, he feareth not injustice nor begrudging (of his wage).

source: وكذلك أنزلناه قرآنا عربيا وصرفنا فيه من الوعيد لعلهم يتقون أو يحدث لهم ذكرا
en: Thus we have revealed it as a Lecture in Arabic, and have displayed therein certain threats, that peradventure they may keep from evil or that it may cause them to take heed.

source: فتعالى الله الملك الحق ولا تعجل بالقرآن من قبل أن يقضى إليك وحيه وقل رب زدني علما
en: Then exalted be Allah, the True King! And hasten not (O Muhammad) with the Qur'an ere its revelation hath been perfected unto thee, and say: My Lord! Increase me in knowledge.

source: ولقد عهدنا إلى آدم من قبل فنسي ولم نجد له عزما
en: And verily We made a covenant of old with Adam, but he forgot, and We found no constancy in him.

source: وإذ قلنا للملائكة اسجدوا لآدم فسجدوا إلا إبليس أبى
en: And when We said unto the angels: Fall prostrate before Adam, they fell prostrate (all) save Iblis; he refused.

source: فقلنا يا آدم إن هذا عدو لك ولزوجك فلا يخرجنكما من الجنة فتشقى
en: Therefor we said: O Adam! This is an enemy unto thee and unto thy wife, so let him not drive you both out of the Garden so that thou come to toil.

source: إن لك ألا تجوع فيها ولا تعرى
en: It is (vouchsafed) unto thee that thou hungerest not therein nor art naked,

source: وأنك لا تظمأ فيها ولا تضحى
en: And that thou thirstest not therein nor art exposed to the sun's heat.

source: فوسوس إليه الشيطان قال يا آدم هل أدلك على شجرة الخلد وملك لا يبلى
en: But the devil whispered to him, saying: O Adam! Shall I show thee the tree of immortality and power that wasteth not away?

source: فأكلا منها فبدت لهما سوآتهما وطفقا يخصفان عليهما من ورق الجنة وعصى آدم ربه فغوى
en: Then they twain ate thereof, so that their shame became apparent unto them, and they began to hide by heaping on themselves some of the leaves of the Garden. And Adam disobeyed his Lord, so went astray.

source: ثم اجتباه ربه فتاب عليه وهدى
en: Then his Lord chose him, and relented toward him, and guided him.

source: قال اهبطا منها جميعا بعضكم لبعض عدو فإما يأتينكم مني هدى فمن اتبع هداي فلا يضل ولا يشقى
en: He said: Go down hence, both of you, one of you a foe unto the other. But when there come unto you from Me a guidance, then whoso followeth My guidance, he will not go astray nor come to grief.

source: ومن أعرض عن ذكري فإن له معيشة ضنكا ونحشره يوم القيامة أعمى
en: But he who turneth away from remembrance of Me, his will be a narrow life, and I shall bring him blind to the assembly on the Day of Resurrection.

source: قال رب لم حشرتني أعمى وقد كنت بصيرا
en: He will say: My Lord! Wherefor hast Thou gathered me (hither) blind, when I was wont to see?

source: قال كذلك أتتك آياتنا فنسيتها وكذلك اليوم تنسى
en: He will say: So (it must be). Our revelations came unto thee but thou didst forget them. In like manner thou art forgotten this Day.

source: وكذلك نجزي من أسرف ولم يؤمن بآيات ربه ولعذاب الآخرة أشد وأبقى
en: Thus do We reward him who is prodigal and believeth not the revelations of his Lord; and verily the doom of the Hereafter will be sterner and more lasting.

source: أفلم يهد لهم كم أهلكنا قبلهم من القرون يمشون في مساكنهم إن في ذلك لآيات لأولي النهى
en: Is it not a guidance for them (to know) how many a generation We destroyed before them, amid whose dwellings they walk? Lo! therein verily are signs for men of thought.

source: ولولا كلمة سبقت من ربك لكان لزاما وأجل مسمى
en: And but for a decree that had already gone forth from thy Lord, and a term already fixed, the judgment would have been inevitable (in this world).

source: فاصبر على ما يقولون وسبح بحمد ربك قبل طلوع الشمس وقبل غروبها ومن آناء الليل فسبح وأطراف النهار لعلك ترضى
en: Therefor (O Muhammad), bear with what they say, and celebrate the praise of thy Lord ere the rising of the sun and ere the going down thereof. And glorify Him some hours of the night and at the two ends of the day, that thou mayst find acceptance.

source: ولا تمدن عينيك إلى ما متعنا به أزواجا منهم زهرة الحياة الدنيا لنفتنهم فيه ورزق ربك خير وأبقى
en: And strain not thine eyes toward that which We cause some wedded pairs among them to enjoy, the flower of the life of the world, that We may try them thereby. The provision of thy Lord is better and more lasting.

source: وأمر أهلك بالصلاة واصطبر عليها لا نسألك رزقا نحن نرزقك والعاقبة للتقوى
en: And enjoin upon thy people worship, and be constant therein. We ask not of thee a provision: We provided for thee. And the sequel is for righteousness.

source: وقالوا لولا يأتينا بآية من ربه أولم تأتهم بينة ما في الصحف الأولى
en: And they say: If only he would bring us a miracle from his Lord! Hath there not come unto them the proof of what is in the former scriptures?

source: ولو أنا أهلكناهم بعذاب من قبله لقالوا ربنا لولا أرسلت إلينا رسولا فنتبع آياتك من قبل أن نذل ونخزى
en: And if we had destroyed them with some punishment before it, they would assuredly have said: Our Lord! If only Thou hadst sent unto us a messenger, so that we might have followed Thy revelations before we were (thus) humbled and disgraced!

source: قل كل متربص فتربصوا فستعلمون من أصحاب الصراط السوي ومن اهتدى
en: Say: Each is awaiting; so await ye! Ye will come to know who are the owners of the path of equity, and who is right.

source: اقترب للناس حسابهم وهم في غفلة معرضون
en: Their reckoning draweth nigh for mankind, while they turn away in heedlessness.

source: ما يأتيهم من ذكر من ربهم محدث إلا استمعوه وهم يلعبون
en: Never cometh there unto them a new reminder from their Lord but they listen to it while they play,

source: لاهية قلوبهم وأسروا النجوى الذين ظلموا هل هذا إلا بشر مثلكم أفتأتون السحر وأنتم تبصرون
en: With hearts preoccupied. And they confer in secret. The wrong-doers say: Is this other than a mortal like you? Will ye then succumb to magic when ye see (it)?

source: قال ربي يعلم القول في السماء والأرض وهو السميع العليم
en: He saith: My Lord knoweth what is spoken in the heaven and the earth. He is the Hearer, the Knower.

source: بل قالوا أضغاث أحلام بل افتراه بل هو شاعر فليأتنا بآية كما أرسل الأولون
en: Nay, say they, (these are but) muddled dreams; nay, he hath but invented it; nay, he is but a poet. Let him bring us a portent even as those of old (who were Allah's messengers) were sent (with portents).

source: ما آمنت قبلهم من قرية أهلكناها أفهم يؤمنون
en: Not a township believed of those which We destroyed before them (though We sent them portents): would they then believe?

source: وما أرسلنا قبلك إلا رجالا نوحي إليهم فاسألوا أهل الذكر إن كنتم لا تعلمون
en: And We sent not (as Our messengers) before thee other than men, whom We inspired. Ask the followers of the Reminder if ye know not?

source: وما جعلناهم جسدا لا يأكلون الطعام وما كانوا خالدين
en: We gave them not bodies that would not eat food, nor were they immortals.

source: ثم صدقناهم الوعد فأنجيناهم ومن نشاء وأهلكنا المسرفين
en: Then we fulfilled the promise unto them. So we delivered them and whom We would, and We destroyed the prodigals.

source: لقد أنزلنا إليكم كتابا فيه ذكركم أفلا تعقلون
en: Now We have revealed unto you a Scripture wherein is your Reminder. Have ye then no sense?

source: وكم قصمنا من قرية كانت ظالمة وأنشأنا بعدها قوما آخرين
en: How many a community that dealt unjustly have We shattered, and raised up after them another folk!

source: فلما أحسوا بأسنا إذا هم منها يركضون
en: And, when they felt Our might, behold them fleeing from it!

source: لا تركضوا وارجعوا إلى ما أترفتم فيه ومساكنكم لعلكم تسألون
en: (But it was said unto them): Flee not, but return to that (existence) which emasculated you and to your dwellings, that ye may be questioned.

source: قالوا يا ويلنا إنا كنا ظالمين
en: They cried: Alas for us! we were wrong-doers.

source: فما زالت تلك دعواهم حتى جعلناهم حصيدا خامدين
en: And this their crying ceased not till We made them as reaped corn, extinct.

source: وما خلقنا السماء والأرض وما بينهما لاعبين
en: We created not the heaven and the earth and all that is between them in play.

source: لو أردنا أن نتخذ لهوا لاتخذناه من لدنا إن كنا فاعلين
en: If We had wished to find a pastime, We could have found it in Our presence - if We ever did.

source: بل نقذف بالحق على الباطل فيدمغه فإذا هو زاهق ولكم الويل مما تصفون
en: Nay, but We hurl the true against the false, and it doth break its head and lo! it vanisheth. And yours will be woe for that which ye ascribe (unto Him).

source: وله من في السماوات والأرض ومن عنده لا يستكبرون عن عبادته ولا يستحسرون
en: Unto Him belongeth whosoever is in the heavens and the earth. And those who dwell in His presence are not too proud to worship Him, nor do they weary;

source: يسبحون الليل والنهار لا يفترون
en: They glorify (Him) night and day; they flag not.

source: أم اتخذوا آلهة من الأرض هم ينشرون
en: Or have they chosen gods from the earth who raise the dead?

source: لو كان فيهما آلهة إلا الله لفسدتا فسبحان الله رب العرش عما يصفون
en: If there were therein gods beside Allah, then verily both (the heavens and the earth) had been disordered. Glorified be Allah, the Lord of the Throne, from all that they ascribe (unto Him).

source: لا يسأل عما يفعل وهم يسألون
en: He will not be questioned as to that which He doeth, but they will be questioned.

source: أم اتخذوا من دونه آلهة قل هاتوا برهانكم هذا ذكر من معي وذكر من قبلي بل أكثرهم لا يعلمون الحق فهم معرضون
en: Or have they chosen other gods beside Him? say: Bring your proof (of their godhead). This is the Reminder of those with me and those before me, but most of them know not the Truth and so they are averse.

source: وما أرسلنا من قبلك من رسول إلا نوحي إليه أنه لا إله إلا أنا فاعبدون
en: And We sent no messenger before thee but We inspired him, (saying): There is no Allah save Me (Allah), so worship Me.

source: وقالوا اتخذ الرحمن ولدا سبحانه بل عباد مكرمون
en: And they say: The Beneficent hath taken unto Himself a son. Be He Glorified! Nay, but (those whom they call sons) are honoured slaves;

source: لا يسبقونه بالقول وهم بأمره يعملون
en: They speak not until He hath spoken, and they act by His command.

source: يعلم ما بين أيديهم وما خلفهم ولا يشفعون إلا لمن ارتضى وهم من خشيته مشفقون
en: He knoweth what is before them and what is behind them, and they cannot intercede except for him whom He accepteth, and they quake for awe of Him.

source: ومن يقل منهم إني إله من دونه فذلك نجزيه جهنم كذلك نجزي الظالمين
en: And one of them who should say: Lo! I am a god beside Him, that one We should repay with hell. Thus We Repay wrong-doers.

source: أولم ير الذين كفروا أن السماوات والأرض كانتا رتقا ففتقناهما وجعلنا من الماء كل شيء حي أفلا يؤمنون
en: Have not those who disbelieve known that the heavens and the earth were of one piece, then We parted them, and we made every living thing of water? Will they not then believe?

source: وجعلنا في الأرض رواسي أن تميد بهم وجعلنا فيها فجاجا سبلا لعلهم يهتدون
en: And We have placed in the earth firm hills lest it quake with them, and We have placed therein ravines as roads that haply they may find their way.

source: وجعلنا السماء سقفا محفوظا وهم عن آياتها معرضون
en: And we have made the sky a roof withheld (from them). Yet they turn away from its portents.

source: وهو الذي خلق الليل والنهار والشمس والقمر كل في فلك يسبحون
en: And He it is Who created the night and the day, and the sun and the moon. They float, each in an orbit.

source: وما جعلنا لبشر من قبلك الخلد أفإن مت فهم الخالدون
en: We appointed immortality for no mortal before thee. What! if thou diest, can they be immortal!

source: كل نفس ذائقة الموت ونبلوكم بالشر والخير فتنة وإلينا ترجعون
en: Every soul must taste of death, and We try you with evil and with good, for ordeal. And unto Us ye will be returned.

source: وإذا رآك الذين كفروا إن يتخذونك إلا هزوا أهذا الذي يذكر آلهتكم وهم بذكر الرحمن هم كافرون
en: And when those who disbelieve behold thee, they but choose thee out for mockery, (saying): Is this he who maketh mention of your gods? And they would deny all mention of the Beneficent.

source: خلق الإنسان من عجل سأريكم آياتي فلا تستعجلون
en: Man is made of haste. I shall show you My portents, but ask Me not to hasten.

source: لو يعلم الذين كفروا حين لا يكفون عن وجوههم النار ولا عن ظهورهم ولا هم ينصرون
en: If those who disbelieved but knew the time when they will not be able to drive off the fire from their faces and from their backs, and they will not be helped!

source: بل تأتيهم بغتة فتبهتهم فلا يستطيعون ردها ولا هم ينظرون
en: Nay, but it will come upon them unawares so that it will stupefy them, and they will be unable to repel it, neither will they be reprieved.

source: قل من يكلؤكم بالليل والنهار من الرحمن بل هم عن ذكر ربهم معرضون
en: Say: Who guardeth you in the night or in the day from the Beneficent? Nay, but they turn away from mention of their Lord!

source: أم لهم آلهة تمنعهم من دوننا لا يستطيعون نصر أنفسهم ولا هم منا يصحبون
en: Or have they gods who can shield them from Us? They cannot help themselves nor can they be defended from Us.

source: بل متعنا هؤلاء وآباءهم حتى طال عليهم العمر أفلا يرون أنا نأتي الأرض ننقصها من أطرافها أفهم الغالبون
en: Nay, but We gave these and their fathers ease until life grew long for them. See they not how we aim to the land, reducing it of its outlying parts? Can they then be the victors?

source: قل إنما أنذركم بالوحي ولا يسمع الصم الدعاء إذا ما ينذرون
en: Say (O Muhammad, unto mankind): I warn you only by the Inspiration. But the deaf hear not the call when they are warned.

source: ولئن مستهم نفحة من عذاب ربك ليقولن يا ويلنا إنا كنا ظالمين
en: And if a breath of thy Lord's punishment were to touch them, they assuredly would say: Alas for us! Lo! we were wrong-doers.

source: ونضع الموازين القسط ليوم القيامة فلا تظلم نفس شيئا وإن كان مثقال حبة من خردل أتينا بها وكفى بنا حاسبين
en: And We set a just balance for the Day of Resurrection so that no soul is wronged in aught. Though it be of the weight of a grain of mustard seed, We bring it. And We suffice for reckoners.

source: ولقد آتينا موسى وهارون الفرقان وضياء وذكرا للمتقين
en: And We verily gave Moses and Aaron the Criterion (of right and wrong) and a light and a Reminder for those who keep from evil,

source: الذين يخشون ربهم بالغيب وهم من الساعة مشفقون
en: Those who fear their Lord in secret and who dread the Hour (of doom).

source: وهذا ذكر مبارك أنزلناه أفأنتم له منكرون
en: This is a blessed Reminder that we have revealed: Will ye then reject it?

source: ولقد آتينا إبراهيم رشده من قبل وكنا به عالمين
en: And We verily gave Abraham of old his proper course, and We were Aware of him,

source: إذ قال لأبيه وقومه ما هذه التماثيل التي أنتم لها عاكفون
en: When he said unto his father and his folk: What are these images unto which ye pay devotion?

source: قالوا وجدنا آباءنا لها عابدين
en: They said: We found our fathers worshippers of them.

source: قال لقد كنتم أنتم وآباؤكم في ضلال مبين
en: He said: Verily ye and your fathers were in plain error.

source: قالوا أجئتنا بالحق أم أنت من اللاعبين
en: They said: Bringest thou unto us the truth, or art thou some jester?

source: قال بل ربكم رب السماوات والأرض الذي فطرهن وأنا على ذلكم من الشاهدين
en: He said: Nay, but your Lord is the Lord of the heavens and the earth, Who created them; and I am of those who testify unto that.

source: وتالله لأكيدن أصنامكم بعد أن تولوا مدبرين
en: And, by Allah, I shall circumvent your idols after ye have gone away and turned your backs.

source: فجعلهم جذاذا إلا كبيرا لهم لعلهم إليه يرجعون
en: Then he reduced them to fragments, all save the chief of them, that haply they might have recourse to it.

source: قالوا من فعل هذا بآلهتنا إنه لمن الظالمين
en: They said: Who hath done this to our gods? Surely it must be some evil-doer.

source: قالوا سمعنا فتى يذكرهم يقال له إبراهيم
en: They said: We heard a youth make mention of them, who is called Abraham.

source: قالوا فأتوا به على أعين الناس لعلهم يشهدون
en: They said: Then bring him (hither) before the people's eyes that they may testify.

source: قالوا أأنت فعلت هذا بآلهتنا يا إبراهيم
en: They said: Is it thou who hast done this to our gods, O Abraham?

source: قال بل فعله كبيرهم هذا فاسألوهم إن كانوا ينطقون
en: He said: But this, their chief hath done it. So question them, if they can speak.

source: فرجعوا إلى أنفسهم فقالوا إنكم أنتم الظالمون
en: Then gathered they apart and said: Lo! ye yourselves are the wrong-doers.

source: ثم نكسوا على رءوسهم لقد علمت ما هؤلاء ينطقون
en: And they were utterly confounded, and they said: Well thou knowest that these speak not.

source: قال أفتعبدون من دون الله ما لا ينفعكم شيئا ولا يضركم
en: He said: Worship ye then instead of Allah that which cannot profit you at all, nor harm you?

source: أف لكم ولما تعبدون من دون الله أفلا تعقلون
en: Fie on you and all that ye worship instead of Allah! Have ye then no sense?

source: قالوا حرقوه وانصروا آلهتكم إن كنتم فاعلين
en: They cried: Burn him and stand by your gods, if ye will be doing.

source: قلنا يا نار كوني بردا وسلاما على إبراهيم
en: We said: O fire, be coolness and peace for Abraham,

source: وأرادوا به كيدا فجعلناهم الأخسرين
en: And they wished to set a snare for him, but We made them the greater losers.

source: ونجيناه ولوطا إلى الأرض التي باركنا فيها للعالمين
en: And We rescued him and Lot (and brought them) to the land which We have blessed for (all) peoples.

source: ووهبنا له إسحاق ويعقوب نافلة وكلا جعلنا صالحين
en: And We bestowed upon him Isaac, and Jacob as a grandson. Each of them We made righteous.

source: وجعلناهم أئمة يهدون بأمرنا وأوحينا إليهم فعل الخيرات وإقام الصلاة وإيتاء الزكاة وكانوا لنا عابدين
en: And We made them chiefs who guide by Our command, and We inspired in them the doing of good deeds and the right establishment of worship and the giving of alms, and they were worshippers of Us (alone).

source: ولوطا آتيناه حكما وعلما ونجيناه من القرية التي كانت تعمل الخبائث إنهم كانوا قوم سوء فاسقين
en: And unto Lot we gave judgment and knowledge, and We delivered him from the community that did abominations. Lo! they were folk of evil, lewd.

source: وأدخلناه في رحمتنا إنه من الصالحين
en: And We brought him in unto Our mercy. Lo! he was of the righteous.

source: ونوحا إذ نادى من قبل فاستجبنا له فنجيناه وأهله من الكرب العظيم
en: And Noah, when he cried of old, We heard his prayer and saved him and his household from the great affliction.

source: ونصرناه من القوم الذين كذبوا بآياتنا إنهم كانوا قوم سوء فأغرقناهم أجمعين
en: And delivered him from the people who denied Our revelations. Lo! they were folk of evil, therefor did We drown them all.

source: وداوود وسليمان إذ يحكمان في الحرث إذ نفشت فيه غنم القوم وكنا لحكمهم شاهدين
en: And David and Solomon, when they gave judgment concerning the field, when people's sheep had strayed and browsed therein by night; and We were witnesses to their judgment.

source: ففهمناها سليمان وكلا آتينا حكما وعلما وسخرنا مع داوود الجبال يسبحن والطير وكنا فاعلين
en: And We made Solomon to understand (the case); and unto each of them We gave judgment and knowledge. And we subdued the hills and the birds to hymn (His) praise along with David. We were the doers (thereof).

source: وعلمناه صنعة لبوس لكم لتحصنكم من بأسكم فهل أنتم شاكرون
en: And We taught him the art of making garments (of mail) to protect you in your daring. Are ye then thankful?

source: ولسليمان الريح عاصفة تجري بأمره إلى الأرض التي باركنا فيها وكنا بكل شيء عالمين
en: And unto Solomon (We subdued) the wind in its raging. It set by his command toward the land which We had blessed. And of everything We are Aware.

source: ومن الشياطين من يغوصون له ويعملون عملا دون ذلك وكنا لهم حافظين
en: And of the evil ones (subdued We unto him) some who dived (for pearls) for him and did other work, and We were warders unto them.

source: وأيوب إذ نادى ربه أني مسني الضر وأنت أرحم الراحمين
en: And Job, when he cried unto his Lord, (saying): Lo! adversity afflicteth me, and Thou art Most Merciful of all who show mercy.

source: فاستجبنا له فكشفنا ما به من ضر وآتيناه أهله ومثلهم معهم رحمة من عندنا وذكرى للعابدين
en: Then We heard his prayer and removed that adversity from which he suffered, and We gave him his household (that he had lost) and the like thereof along with them, a mercy from Our store, and a remembrance for the worshippers;

source: وإسماعيل وإدريس وذا الكفل كل من الصابرين
en: And (mention) Ishmael, and Idris, and Dhu'l-Kifl. All were of the steadfast.

source: وأدخلناهم في رحمتنا إنهم من الصالحين
en: And We brought them in unto Our mercy. Lo! they are among the righteous.

source: وذا النون إذ ذهب مغاضبا فظن أن لن نقدر عليه فنادى في الظلمات أن لا إله إلا أنت سبحانك إني كنت من الظالمين
en: And (mention) Dhu'n-Nun, when he went off in anger and deemed that We had no power over him, but he cried out in the darkness, saying: There is no Allah save Thee. Be Thou Glorified! Lo! I have been a wrong-doer.

source: فاستجبنا له ونجيناه من الغم وكذلك ننجي المؤمنين
en: Then we heard his prayer and saved him from the anguish. Thus we save believers.

source: وزكريا إذ نادى ربه رب لا تذرني فردا وأنت خير الوارثين
en: And Zachariah, when he cried unto his Lord: My Lord! Leave me not childless, though Thou art the Best of inheritors.

source: فاستجبنا له ووهبنا له يحيى وأصلحنا له زوجه إنهم كانوا يسارعون في الخيرات ويدعوننا رغبا ورهبا وكانوا لنا خاشعين
en: Then We heard his prayer, and bestowed upon him John, and adjusted his wife (to bear a child) for him. Lo! they used to vie one with the other in good deeds, and they cried unto Us in longing and in fear, and were submissive unto Us.

source: والتي أحصنت فرجها فنفخنا فيها من روحنا وجعلناها وابنها آية للعالمين
en: And she who was chaste, therefor We breathed into her (something) of Our Spirit and made her and her son a token for (all) peoples.

source: إن هذه أمتكم أمة واحدة وأنا ربكم فاعبدون
en: Lo! this, your religion, is one religion, and I am your Lord, so worship Me.

source: وتقطعوا أمرهم بينهم كل إلينا راجعون
en: And they have broken their religion (into fragments) among them, (yet) all are returning unto Us.

source: فمن يعمل من الصالحات وهو مؤمن فلا كفران لسعيه وإنا له كاتبون
en: Then whoso doeth some good works and is a believer, there will be no rejection of his effort. Lo! We record (it) for him.

source: وحرام على قرية أهلكناها أنهم لا يرجعون
en: And there is a ban upon any community which We have destroyed: that they shall not return.

source: حتى إذا فتحت يأجوج ومأجوج وهم من كل حدب ينسلون
en: Until, when Gog and Magog are let loose, and they hasten out of every mound,

source: واقترب الوعد الحق فإذا هي شاخصة أبصار الذين كفروا يا ويلنا قد كنا في غفلة من هذا بل كنا ظالمين
en: And the True Promise draweth nigh; then behold them, staring wide (in terror), the eyes of those who disbelieve! (They say): Alas for us! We (lived) in forgetfulness of this. Ah, but we were wrong-doers!

source: إنكم وما تعبدون من دون الله حصب جهنم أنتم لها واردون
en: Lo! ye (idolaters) and that which ye worship beside Allah are fuel of hell. Thereunto ye will come.

source: لو كان هؤلاء آلهة ما وردوها وكل فيها خالدون
en: If these had been gods they would not have come thither, but all will abide therein.

source: لهم فيها زفير وهم فيها لا يسمعون
en: Therein wailing is their portion, and therein they hear not.

source: إن الذين سبقت لهم منا الحسنى أولئك عنها مبعدون
en: Lo! those unto whom kindness hath gone forth before from Us, they will be far removed from thence.

source: لا يسمعون حسيسها وهم في ما اشتهت أنفسهم خالدون
en: They will not hear the slightest sound thereof, while they abide in that which their souls desire.

source: لا يحزنهم الفزع الأكبر وتتلقاهم الملائكة هذا يومكم الذي كنتم توعدون
en: The Supreme Horror will not grieve them, and the angels will welcome them, (saying): This is your Day which ye were promised;
